{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 128,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 128
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "NFD"
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Metaspace",
    "replacement": "▁",
    "prepend_scheme": "always",
    "split": true
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "Metaspace",
    "replacement": "▁",
    "prepend_scheme": "always",
    "split": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "\t": 5,
      "\n": 6,
      "\u0013": 7,
      "!": 8,
      "\"": 9,
      "#": 10,
      "$": 11,
      "%": 12,
      "&": 13,
      "'": 14,
      "(": 15,
      ")": 16,
      "*": 17,
      "+": 18,
      ",": 19,
      "-": 20,
      ".": 21,
      "/": 22,
      "0": 23,
      "1": 24,
      "2": 25,
      "3": 26,
      "4": 27,
      "5": 28,
      "6": 29,
      "7": 30,
      "8": 31,
      "9": 32,
      ":": 33,
      ";": 34,
      "<": 35,
      "=": 36,
      ">": 37,
      "?": 38,
      "@": 39,
      "A": 40,
      "B": 41,
      "C": 42,
      "D": 43,
      "E": 44,
      "F": 45,
      "G": 46,
      "H": 47,
      "I": 48,
      "J": 49,
      "K": 50,
      "L": 51,
      "M": 52,
      "N": 53,
      "O": 54,
      "P": 55,
      "Q": 56,
      "R": 57,
      "S": 58,
      "T": 59,
      "U": 60,
      "V": 61,
      "W": 62,
      "X": 63,
      "Y": 64,
      "Z": 65,
      "[": 66,
      "\\": 67,
      "]": 68,
      "^": 69,
      "_": 70,
      "`": 71,
      "a": 72,
      "b": 73,
      "c": 74,
      "d": 75,
      "e": 76,
      "f": 77,
      "g": 78,
      "h": 79,
      "i": 80,
      "j": 81,
      "k": 82,
      "l": 83,
      "m": 84,
      "n": 85,
      "o": 86,
      "p": 87,
      "q": 88,
      "r": 89,
      "s": 90,
      "t": 91,
      "u": 92,
      "v": 93,
      "w": 94,
      "x": 95,
      "y": 96,
      "z": 97,
      "{": 98,
      "|": 99,
      "}": 100,
      "~": 101,
      " ": 102,
      "£": 103,
      "§": 104,
      "©": 105,
      "«": 106,
      "®": 107,
      "¯": 108,
      "´": 109,
      "µ": 110,
      "¶": 111,
      "·": 112,
      "»": 113,
      "¿": 114,
      "×": 115,
      "æ": 116,
      "ð": 117,
      "÷": 118,
      "ø": 119,
      "þ": 120,
      "ı": 121,
      "ł": 122,
      "œ": 123,
      "˜": 124,
      "Α": 125,
      "Ε": 126,
      "Ι": 127,
      "Κ": 128,
      "Μ": 129,
      "Ν": 130,
      "Ο": 131,
      "Π": 132,
      "Ρ": 133,
      "Σ": 134,
      "Τ": 135,
      "Χ": 136,
      "Ω": 137,
      "μ": 138,
      "ϕ": 139,
      "А": 140,
      "Б": 141,
      "В": 142,
      "Е": 143,
      "Ж": 144,
      "З": 145,
      "И": 146,
      "К": 147,
      "Л": 148,
      "М": 149,
      "Н": 150,
      "О": 151,
      "П": 152,
      "Р": 153,
      "С": 154,
      "Т": 155,
      "У": 156,
      "Х": 157,
      "Ц": 158,
      "Ч": 159,
      "Ь": 160,
      "Я": 161,
      "а": 162,
      "б": 163,
      "в": 164,
      "г": 165,
      "д": 166,
      "е": 167,
      "ж": 168,
      "з": 169,
      "и": 170,
      "к": 171,
      "л": 172,
      "м": 173,
      "н": 174,
      "о": 175,
      "п": 176,
      "р": 177,
      "с": 178,
      "т": 179,
      "у": 180,
      "ф": 181,
      "х": 182,
      "ц": 183,
      "ч": 184,
      "ш": 185,
      "щ": 186,
      "ы": 187,
      "ь": 188,
      "э": 189,
      "ю": 190,
      "я": 191,
      "ا": 192,
      "ب": 193,
      "ة": 194,
      "ت": 195,
      "ح": 196,
      "د": 197,
      "ر": 198,
      "س": 199,
      "ط": 200,
      "ع": 201,
      "ق": 202,
      "ك": 203,
      "ل": 204,
      "م": 205,
      "ن": 206,
      "ي": 207,
      "་": 208,
      "ཀ": 209,
      "ཆ": 210,
      "ར": 211,
      "ས": 212,
      "ᄀ": 213,
      "ᄂ": 214,
      "ᄃ": 215,
      "ᄄ": 216,
      "ᄅ": 217,
      "ᄆ": 218,
      "ᄇ": 219,
      "ᄉ": 220,
      "ᄊ": 221,
      "ᄋ": 222,
      "ᄌ": 223,
      "ᄍ": 224,
      "ᄎ": 225,
      "ᄏ": 226,
      "ᄐ": 227,
      "ᄑ": 228,
      "ᄒ": 229,
      "ᅡ": 230,
      "ᅢ": 231,
      "ᅣ": 232,
      "ᅥ": 233,
      "ᅦ": 234,
      "ᅧ": 235,
      "ᅩ": 236,
      "ᅪ": 237,
      "ᅬ": 238,
      "ᅭ": 239,
      "ᅮ": 240,
      "ᅯ": 241,
      "ᅲ": 242,
      "ᅳ": 243,
      "ᅴ": 244,
      "ᅵ": 245,
      "ᆨ": 246,
      "ᆩ": 247,
      "ᆫ": 248,
      "ᆭ": 249,
      "ᆯ": 250,
      "ᆷ": 251,
      "ᆸ": 252,
      "ᆹ": 253,
      "ᆻ": 254,
      "ᆼ": 255,
      "ᇂ": 256,
      "​": 257,
      "‌": 258,
      "‐": 259,
      "–": 260,
      "—": 261,
      "‗": 262,
      "‘": 263,
      "’": 264,
      "‚": 265,
      "“": 266,
      "”": 267,
      "†": 268,
      "•": 269,
      "…": 270,
      " ": 271,
      "‰": 272,
      "‹": 273,
      "€": 274,
      "™": 275,
      "−": 276,
      "≤": 277,
      "≥": 278,
      "│": 279,
      "▁": 280,
      "□": 281,
      "☺": 282,
      "✬": 283,
      "　": 284,
      "、": 285,
      "。": 286,
      "あ": 287,
      "い": 288,
      "う": 289,
      "え": 290,
      "お": 291,
      "か": 292,
      "き": 293,
      "く": 294,
      "け": 295,
      "こ": 296,
      "さ": 297,
      "し": 298,
      "す": 299,
      "せ": 300,
      "そ": 301,
      "た": 302,
      "ち": 303,
      "っ": 304,
      "つ": 305,
      "て": 306,
      "と": 307,
      "な": 308,
      "に": 309,
      "の": 310,
      "は": 311,
      "ひ": 312,
      "ふ": 313,
      "へ": 314,
      "ほ": 315,
      "ま": 316,
      "み": 317,
      "め": 318,
      "も": 319,
      "よ": 320,
      "ら": 321,
      "り": 322,
      "る": 323,
      "れ": 324,
      "わ": 325,
      "を": 326,
      "ァ": 327,
      "ア": 328,
      "ィ": 329,
      "イ": 330,
      "ウ": 331,
      "ェ": 332,
      "エ": 333,
      "オ": 334,
      "カ": 335,
      "キ": 336,
      "ク": 337,
      "ケ": 338,
      "コ": 339,
      "シ": 340,
      "ス": 341,
      "セ": 342,
      "ソ": 343,
      "タ": 344,
      "チ": 345,
      "ッ": 346,
      "テ": 347,
      "ト": 348,
      "ニ": 349,
      "ネ": 350,
      "ノ": 351,
      "ハ": 352,
      "ヒ": 353,
      "フ": 354,
      "ヘ": 355,
      "ホ": 356,
      "マ": 357,
      "ム": 358,
      "メ": 359,
      "ャ": 360,
      "ュ": 361,
      "ョ": 362,
      "ラ": 363,
      "リ": 364,
      "ル": 365,
      "レ": 366,
      "ロ": 367,
      "ン": 368,
      "・": 369,
      "ー": 370,
      "一": 371,
      "上": 372,
      "下": 373,
      "不": 374,
      "並": 375,
      "个": 376,
      "中": 377,
      "了": 378,
      "事": 379,
      "于": 380,
      "五": 381,
      "交": 382,
      "今": 383,
      "介": 384,
      "以": 385,
      "仮": 386,
      "任": 387,
      "位": 388,
      "体": 389,
      "何": 390,
      "余": 391,
      "作": 392,
      "使": 393,
      "例": 394,
      "保": 395,
      "信": 396,
      "個": 397,
      "倒": 398,
      "値": 399,
      "值": 400,
      "偽": 401,
      "先": 402,
      "入": 403,
      "全": 404,
      "共": 405,
      "内": 406,
      "再": 407,
      "処": 408,
      "出": 409,
      "函": 410,
      "分": 411,
      "切": 412,
      "列": 413,
      "创": 414,
      "初": 415,
      "删": 416,
      "判": 417,
      "制": 418,
      "削": 419,
      "前": 420,
      "割": 421,
      "力": 422,
      "功": 423,
      "効": 424,
      "化": 425,
      "区": 426,
      "单": 427,
      "単": 428,
      "印": 429,
      "发": 430,
      "取": 431,
      "受": 432,
      "口": 433,
      "只": 434,
      "可": 435,
      "合": 436,
      "同": 437,
      "名": 438,
      "向": 439,
      "含": 440,
      "周": 441,
      "呼": 442,
      "和": 443,
      "問": 444,
      "器": 445,
      "回": 446,
      "图": 447,
      "在": 448,
      "地": 449,
      "址": 450,
      "垂": 451,
      "型": 452,
      "報": 453,
      "場": 454,
      "声": 455,
      "変": 456,
      "复": 457,
      "外": 458,
      "多": 459,
      "大": 460,
      "失": 461,
      "始": 462,
      "媒": 463,
      "子": 464,
      "字": 465,
      "存": 466,
      "宋": 467,
      "宏": 468,
      "定": 469,
      "実": 470,
      "宣": 471,
      "容": 472,
      "寄": 473,
      "对": 474,
      "対": 475,
      "射": 476,
      "小": 477,
      "居": 478,
      "岐": 479,
      "差": 480,
      "已": 481,
      "带": 482,
      "常": 483,
      "平": 484,
      "年": 485,
      "度": 486,
      "延": 487,
      "建": 488,
      "式": 489,
      "引": 490,
      "後": 491,
      "得": 492,
      "微": 493,
      "必": 494,
      "応": 495,
      "情": 496,
      "想": 497,
      "意": 498,
      "態": 499,
      "成": 500,
      "戻": 501,
      "抜": 502,
      "択": 503,
      "押": 504,
      "指": 505,
      "振": 506,
      "提": 507,
      "換": 508,
      "播": 509,
      "操": 510,
      "放": 511,
      "敗": 512,
      "敢": 513,
      "数": 514,
      "整": 515,
      "數": 516,
      "文": 517,
      "断": 518,
      "方": 519,
      "既": 520,
      "时": 521,
      "明": 522,
      "映": 523,
      "時": 524,
      "普": 525,
      "景": 526,
      "書": 527,
      "最": 528,
      "有": 529,
      "期": 530,
      "未": 531,
      "来": 532,
      "构": 533,
      "枚": 534,
      "査": 535,
      "根": 536,
      "格": 537,
      "桁": 538,
      "棄": 539,
      "検": 540,
      "構": 541,
      "標": 542,
      "次": 543,
      "正": 544,
      "残": 545,
      "水": 546,
      "求": 547,
      "況": 548,
      "浅": 549,
      "测": 550,
      "深": 551,
      "混": 552,
      "測": 553,
      "準": 554,
      "無": 555,
      "片": 556,
      "状": 557,
      "独": 558,
      "率": 559,
      "現": 560,
      "理": 561,
      "生": 562,
      "用": 563,
      "異": 564,
      "発": 565,
      "登": 566,
      "白": 567,
      "的": 568,
      "目": 569,
      "盲": 570,
      "直": 571,
      "眉": 572,
      "真": 573,
      "矢": 574,
      "知": 575,
      "短": 576,
      "破": 577,
      "确": 578,
      "確": 579,
      "示": 580,
      "社": 581,
      "祖": 582,
      "秒": 583,
      "積": 584,
      "立": 585,
      "符": 586,
      "第": 587,
      "算": 588,
      "築": 589,
      "篩": 590,
      "納": 591,
      "素": 592,
      "累": 593,
      "終": 594,
      "組": 595,
      "結": 596,
      "絶": 597,
      "続": 598,
      "级": 599,
      "结": 600,
      "置": 601,
      "美": 602,
      "義": 603,
      "背": 604,
      "能": 605,
      "自": 606,
      "行": 607,
      "表": 608,
      "複": 609,
      "要": 610,
      "見": 611,
      "親": 612,
      "见": 613,
      "解": 614,
      "言": 615,
      "計": 616,
      "記": 617,
      "設": 618,
      "認": 619,
      "読": 620,
      "調": 621,
      "试": 622,
      "调": 623,
      "象": 624,
      "負": 625,
      "超": 626,
      "身": 627,
      "软": 628,
      "载": 629,
      "输": 630,
      "込": 631,
      "返": 632,
      "送": 633,
      "通": 634,
      "造": 635,
      "連": 636,
      "違": 637,
      "選": 638,
      "部": 639,
      "配": 640,
      "重": 641,
      "録": 642,
      "链": 643,
      "長": 644,
      "閉": 645,
      "開": 646,
      "関": 647,
      "限": 648,
      "除": 649,
      "雅": 650,
      "集": 651,
      "面": 652,
      "項": 653,
      "題": 654,
      "须": 655,
      "高": 656,
      "黑": 657,
      "﻿": 658,
      "＆": 659,
      "（": 660,
      "）": 661,
      "，": 662,
      "：": 663,
      "�": 664,
      "🕐": 665,
      "🕑": 666,
      "🕒": 667,
      "🕓": 668,
      "🕔": 669,
      "🕕": 670,
      "🕖": 671,
      "🕗": 672,
      "🕘": 673,
      "🕙": 674,
      "🕚": 675,
      "🕛": 676,
      "in": 677,
      ";\n": 678,
      "er": 679,
      "on": 680,
      "st": 681,
      "re": 682,
      "at": 683,
      "or": 684,
      "le": 685,
      "▁=": 686,
      "\n\n": 687,
      "▁t": 688,
      "ar": 689,
      "en": 690,
      "--": 691,
      ");\n": 692,
      "▁c": 693,
      "se": 694,
      "al": 695,
      "ct": 696,
      "it": 697,
      "an": 698,
      "de": 699,
      "{\n": 700,
      "▁<": 701,
      "me": 702,
      "ion": 703,
      "▁f": 704,
      "▁p": 705,
      "ou": 706,
      "int": 707,
      ")\n": 708,
      "00": 709,
      "▁i": 710,
      "li": 711,
      "he": 712,
      "▁s": 713,
      "▁(": 714,
      ">\n": 715,
      "ge": 716,
      "▁{\n": 717,
      "ss": 718,
      "▁n": 719,
      "ad": 720,
      "\t\t": 721,
      "ing": 722,
      "▁}": 723,
      "▁1": 724,
      "=\"": 725,
      "la": 726,
      "ro": 727,
      "▁0": 728,
      "ent": 729,
      "▁\"": 730,
      "▁b": 731,
      "id": 732,
      "ate": 733,
      "----": 734,
      "▁*": 735,
      "di": 736,
      "te": 737,
      "th": 738,
      "ck": 739,
      "ur": 740,
      "ce": 741,
      "lo": 742,
      "un": 743,
      "▁re": 744,
      "//": 745,
      "ame": 746,
      "▁\n": 747,
      "▁a": 748,
      "mp": 749,
      "▁m": 750,
      "()": 751,
      "tr": 752,
      "ol": 753,
      "\",": 754,
      "ue": 755,
      "▁st": 756,
      "s.": 757,
      "▁v": 758,
      "(\"": 759,
      "el": 760,
      "▁w": 761,
      "ch": 762,
      "px": 763,
      "ig": 764,
      "ut": 765,
      "</": 766,
      "pe": 767,
      "ht": 768,
      "ction": 769,
      "op": 770,
      "▁d": 771,
      "um": 772,
      "xt": 773,
      "▁S": 774,
      "lass": 775,
      "}\n\n": 776,
      "hi": 777,
      "ri": 778,
      "get": 779,
      "▁the": 780,
      "▁in": 781,
      "ed": 782,
      "urn": 783,
      "ew": 784,
      "▁'": 785,
      "turn": 786,
      "ul": 787,
      "nt": 788,
      "▁}\n": 789,
      "▁2": 790,
      "**": 791,
      "L,": 792,
      "div": 793,
      ";\n\n": 794,
      "▁//": 795,
      "ra": 796,
      "ine": 797,
      "ata": 798,
      "::": 799,
      "..": 800,
      "out": 801,
      "ble": 802,
      "▁T": 803,
      "ma": 804,
      ");\n\n": 805,
      "ont": 806,
      "▁+": 807,
      "▁e": 808,
      "▁if": 809,
      "==": 810,
      "of": 811,
      "il": 812,
      "ub": 813,
      "▁-": 814,
      "ode": 815,
      "▁int": 816,
      "ile": 817,
      "ype": 818,
      "et": 819,
      "oo": 820,
      "iz": 821,
      "us": 822,
      "▁return": 823,
      "ic": 824,
      "pt": 825,
      "unction": 826,
      "av": 827,
      "ort": 828,
      "sp": 829,
      "om": 830,
      "▁#": 831,
      "rint": 832,
      "--------": 833,
      ".c": 834,
      ".p": 835,
      "and": 836,
      "alue": 837,
      "▁A": 838,
      "str": 839,
      "▁C": 840,
      "ack": 841,
      "▁N": 842,
      "ot": 843,
      "▁h": 844,
      "▁{": 845,
      "end": 846,
      "▁se": 847,
      "add": 848,
      ":\n": 849,
      "lic": 850,
      "def": 851,
      "orm": 852,
      "ect": 853,
      ",\n": 854,
      "pp": 855,
      "ize": 856,
      "▁I": 857,
      "ight": 858,
      "ation": 859,
      "arg": 860,
      "nd": 861,
      "ord": 862,
      "ff": 863,
      "▁F": 864,
      "▁class": 865,
      "ER": 866,
      "▁to": 867,
      "em": 868,
      "('": 869,
      "ow": 870,
      "able": 871,
      "am": 872,
      "sc": 873,
      "ver": 874,
      "();\n": 875,
      "\">": 876,
      "od": 877,
      "oid": 878,
      "▁new": 879,
      "▁for": 880,
      "ublic": 881,
      "lu": 882,
      "\")": 883,
      "▁}\n\n": 884,
      "ist": 885,
      "▁/": 886,
      "->": 887,
      "__": 888,
      "Re": 889,
      "name": 890,
      "set": 891,
      "▁3": 892,
      "ext": 893,
      "px;\n": 894,
      "is": 895,
      "ve": 896,
      "rou": 897,
      "if": 898,
      "ava": 899,
      "as": 900,
      "▁of": 901,
      "uct": 902,
      "ment": 903,
      "ser": 904,
      "▁P": 905,
      "0,": 906,
      "_t": 907,
      "▁g": 908,
      "▁r": 909,
      "age": 910,
      ")\n\n": 911,
      "line": 912,
      "ans": 913,
      "▁thi": 914,
      "put": 915,
      "01": 916,
      "▁j": 917,
      "▁<-": 918,
      "▁con": 919,
      ">\n\n": 920,
      "▁str": 921,
      "ime": 922,
      "con": 923,
      "▁M": 924,
      "▁|": 925,
      "clu": 926,
      "ft": 927,
      "art": 928,
      "▁B": 929,
      "bj": 930,
      "',": 931,
      ".get": 932,
      "ml": 933,
      "LE": 934,
      "▁function": 935,
      "clude": 936,
      "len": 937,
      "olor": 938,
      "▁*/": 939,
      "▁ch": 940,
      "ers": 941,
      "text": 942,
      "ke": 943,
      "ain": 944,
      "▁is": 945,
      "IN": 946,
      "ity": 947,
      "▁D": 948,
      "),": 949,
      "include": 950,
      "\");\n": 951,
      "idth": 952,
      "In": 953,
      "oc": 954,
      "lf": 955,
      "data": 956,
      "}\n": 957,
      "all": 958,
      "▁li": 959,
      "1,": 960,
      "▁id": 961,
      "(f": 962,
      "ore": 963,
      "tring": 964,
      "St": 965,
      "▁0.": 966,
      "▁<<": 967,
      "\t\t\t\t": 968,
      "()\n": 969,
      "ount": 970,
      "os": 971,
      "qu": 972,
      "ase": 973,
      "one": 974,
      "im": 975,
      "\":": 976,
      "▁&": 977,
      ">\n<": 978,
      "▁tr": 979,
      "ind": 980,
      "_p": 981,
      "grou": 982,
      "ult": 983,
      "))": 984,
      "0000": 985,
      "▁</": 986,
      "d::": 987,
      "▁$": 988,
      ";\n}\n\n": 989,
      "\\n": 990,
      "▁==": 991,
      ".s": 992,
      "mport": 993,
      "ON": 994,
      "▁print": 995,
      ".h": 996,
      "▁>": 997,
      "UL": 998,
      "_c": 999,
      "▁@": 1000,
      "char": 1001,
      "ript": 1002,
      "are": 1003,
      "****": 1004,
      "es": 1005,
      "▁class=\"": 1006,
      "ir": 1007,
      "ror": 1008,
      "▁5": 1009,
      "form": 1010,
      "iel": 1011,
      "▁4": 1012,
      ".j": 1013,
      "up": 1014,
      "ield": 1015,
      "▁x": 1016,
      "ign": 1017,
      "order": 1018,
      "▁th": 1019,
      "▁var": 1020,
      "read": 1021,
      "▁char": 1022,
      "ter": 1023,
      "left": 1024,
      "bu": 1025,
      "\",\"": 1026,
      "▁[": 1027,
      "ber": 1028,
      "script": 1029,
      "ap": 1030,
      "rom": 1031,
      "▁*/\n": 1032,
      "====": 1033,
      "')": 1034,
      "row": 1035,
      "ground": 1036,
      "ID": 1037,
      "▁L": 1038,
      "▁void": 1039,
      "bject": 1040,
      "ackground": 1041,
      "33": 1042,
      "vi": 1043,
      "▁public": 1044,
      "s/": 1045,
      "RE": 1046,
      "##": 1047,
      "html": 1048,
      "we": 1049,
      "RO": 1050,
      "td": 1051,
      "bo": 1052,
      "else": 1053,
      ".f": 1054,
      "▁name": 1055,
      "++": 1056,
      "▁y": 1057,
      "head": 1058,
      "10": 1059,
      "ight:": 1060,
      "omp": 1061,
      "▁and": 1062,
      "ost": 1063,
      ".\n": 1064,
      "\">\n": 1065,
      ");": 1066,
      "ac": 1067,
      "ition": 1068,
      "#include": 1069,
      "ory": 1070,
      "ock": 1071,
      "ay": 1072,
      "ome": 1073,
      "▁me": 1074,
      "Name": 1075,
      "▁de": 1076,
      "▁W": 1077,
      "Id": 1078,
      "▁data": 1079,
      "size": 1080,
      "▁o": 1081,
      "CT": 1082,
      "ag": 1083,
      "▁type": 1084,
      "AT": 1085,
      "\":\"": 1086,
      "act": 1087,
      "f(\"": 1088,
      "▁value": 1089,
      "url": 1090,
      "SE": 1091,
      "yle": 1092,
      "\t\t\t": 1093,
      "▁%": 1094,
      "ite": 1095,
      "▁l": 1096,
      "lement": 1097,
      "▁id=\"": 1098,
      "[i": 1099,
      "px;": 1100,
      "▁!": 1101,
      "lay": 1102,
      "our": 1103,
      "rame": 1104,
      "▁pro": 1105,
      "tp": 1106,
      "gth": 1107,
      "----------------": 1108,
      "AR": 1109,
      "▁std::": 1110,
      "▁this.": 1111,
      "▁E": 1112,
      "ator": 1113,
      "que": 1114,
      "ref": 1115,
      "▁it": 1116,
      "1.": 1117,
      "olor:": 1118,
      "reate": 1119,
      "▁at": 1120,
      "cept": 1121,
      "loc": 1122,
      "vent": 1123,
      "argin": 1124,
      "▁.": 1125,
      "mage": 1126,
      "ab": 1127,
      "0.": 1128,
      "▁O": 1129,
      "ex": 1130,
      "▁di": 1131,
      "y(": 1132,
      "</div": 1133,
      "var": 1134,
      "▁ex": 1135,
      "s(": 1136,
      "▁NUL": 1137,
      "ST": 1138,
      "lect": 1139,
      "ld": 1140,
      "▁:": 1141,
      "idth:": 1142,
      "ert": 1143,
      "12": 1144,
      "est": 1145,
      "▁G": 1146,
      "▁op": 1147,
      "length": 1148,
      "String": 1149,
      "s\n": 1150,
      "_C": 1151,
      "s,": 1152,
      "List": 1153,
      "import": 1154,
      "▁0,": 1155,
      "ull": 1156,
      "[i]": 1157,
      "▁else": 1158,
      "oint": 1159,
      "1]": 1160,
      "▁/*": 1161,
      "▁get": 1162,
      "list": 1163,
      "umber": 1164,
      "ream": 1165,
      "5,": 1166,
      "ive": 1167,
      "▁<div": 1168,
      "><": 1169,
      "value": 1170,
      "ace": 1171,
      "IT": 1172,
      "▁const": 1173,
      "ont-": 1174,
      "2,": 1175,
      "atic": 1176,
      "):\n": 1177,
      ".t": 1178,
      "define": 1179,
      "ument": 1180,
      "66": 1181,
      "yst": 1182,
      "date": 1183,
      "▁8": 1184,
      "struct": 1185,
      "ith": 1186,
      "▁or": 1187,
      "dex": 1188,
      "key": 1189,
      "ody": 1190,
      "void": 1191,
      "(c": 1192,
      "ffer": 1193,
      "riv": 1194,
      "-c": 1195,
      "▁10": 1196,
      "▁\n\n": 1197,
      "string": 1198,
      "new": 1199,
      "ontent": 1200,
      "Ex": 1201,
      "▁H": 1202,
      "ystem": 1203,
      "ray": 1204,
      "atch": 1205,
      "){\n": 1206,
      "sult": 1207,
      "ll": 1208,
      "adding": 1209,
      "ure": 1210,
      ")\n{\n": 1211,
      "▁self": 1212,
      "Value": 1213,
      "http": 1214,
      "ton": 1215,
      "▁be": 1216,
      "#define": 1217,
      "ast": 1218,
      "web": 1219,
      "(p": 1220,
      "...": 1221,
      "ath": 1222,
      "sh": 1223,
      "error": 1224,
      ".a": 1225,
      "itle": 1226,
      "utton": 1227,
      "rc": 1228,
      "▁main": 1229,
      "EN": 1230,
      "▁size": 1231,
      "ree": 1232,
      "100": 1233,
      "user": 1234,
      "public": 1235,
      "ial": 1236,
      "='": 1237,
      "ere": 1238,
      "late": 1239,
      "▁printf(\"": 1240,
      "type": 1241,
      "▁background": 1242,
      "rivate": 1243,
      "AL": 1244,
      "▁on": 1245,
      "ong": 1246,
      "▁java": 1247,
      "Pro": 1248,
      "file": 1249,
      "lock": 1250,
      "▁0;\n": 1251,
      "val": 1252,
      "cess": 1253,
      ".set": 1254,
      "▁un": 1255,
      "▁he": 1256,
      "ec": 1257,
      "vice": 1258,
      "body": 1259,
      "Field": 1260,
      "osition": 1261,
      "▁al": 1262,
      "class": 1263,
      "▁file": 1264,
      "0]": 1265,
      "▁from": 1266,
      ">\n#include": 1267,
      "▁U": 1268,
      "_S": 1269,
      "▁def": 1270,
      "▁NULL": 1271,
      "my": 1272,
      "▁sc": 1273,
      "ink": 1274,
      "ax": 1275,
      "▁J": 1276,
      "self": 1277,
      "mo": 1278,
      "▁out": 1279,
      "-b": 1280,
      "ception": 1281,
      "OR": 1282,
      "ance": 1283,
      "Date": 1284,
      "_b": 1285,
      "▁end": 1286,
      "ssage": 1287,
      "▁arg": 1288,
      "▁by": 1289,
      "log": 1290,
      "quest": 1291,
      "▁this": 1292,
      "emp": 1293,
      ".print": 1294,
      "(x": 1295,
      "Con": 1296,
      "▁line": 1297,
      "[]": 1298,
      "▁6": 1299,
      "></": 1300,
      "IM": 1301,
      "br": 1302,
      "▁an": 1303,
      "(int": 1304,
      "▁100": 1305,
      "alse": 1306,
      "ocument": 1307,
      "▁!=": 1308,
      "odel": 1309,
      "99": 1310,
      "indow": 1311,
      "AA": 1312,
      "▁u": 1313,
      "ly": 1314,
      "25": 1315,
      "og": 1316,
      "FF": 1317,
      "ak": 1318,
      "20": 1319,
      "der": 1320,
      "ip": 1321,
      "▁margin": 1322,
      "▁if(": 1323,
      "input": 1324,
      "▁type=\"": 1325,
      "top": 1326,
      "▁_": 1327,
      "tion": 1328,
      "3,": 1329,
      "\"\n": 1330,
      "heck": 1331,
      "test": 1332,
      ">\n</": 1333,
      "ery": 1334,
      "this": 1335,
      "ND": 1336,
      "_id": 1337,
      "ange": 1338,
      "ener": 1339,
      "▁trans": 1340,
      "loat": 1341,
      "▁text": 1342,
      "▁struct": 1343,
      "const": 1344,
      "(d": 1345,
      "://": 1346,
      "/*": 1347,
      "▁)": 1348,
      "ant": 1349,
      "low": 1350,
      "thod": 1351,
      "s_": 1352,
      "d(": 1353,
      "s[": 1354,
      "▁list": 1355,
      "11": 1356,
      "ute": 1357,
      "ouble": 1358,
      "2.": 1359,
      "Class": 1360,
      "main": 1361,
      "ln": 1362,
      "))\n": 1363,
      "hile": 1364,
      "ocket": 1365,
      "print": 1366,
      "load": 1367,
      "▁String": 1368,
      "▁not": 1369,
      "LECT": 1370,
      "kit": 1371,
      "▁set": 1372,
      "ang": 1373,
      "▁static": 1374,
      "function": 1375,
      "▁href": 1376,
      "********": 1377,
      "▁0;": 1378,
      "amp": 1379,
      "▁V": 1380,
      ".java": 1381,
      "ust": 1382,
      "_s": 1383,
      "32": 1384,
      "image": 1385,
      "Node": 1386,
      "urre": 1387,
      "lot": 1388,
      "File": 1389,
      "splay": 1390,
      "(s": 1391,
      "pro": 1392,
      "========": 1393,
      "ool": 1394,
      "▁border": 1395,
      "lick": 1396,
      "-0": 1397,
      "));\n": 1398,
      "for": 1399,
      "Ch": 1400,
      "64": 1401,
      "lose": 1402,
      "(function": 1403,
      "ww": 1404,
      "▁font-": 1405,
      "▁7": 1406,
      "webkit": 1407,
      "ress": 1408,
      "lab": 1409,
      "Type": 1410,
      "ystem.": 1411,
      "[1]": 1412,
      "box": 1413,
      "▁wh": 1414,
      ").": 1415,
      "temp": 1416,
      "▁R": 1417,
      "▁as": 1418,
      "trans": 1419,
      ".java:": 1420,
      "▁my": 1421,
      "Exception": 1422,
      "style": 1423,
      "ROM": 1424,
      "]\n": 1425,
      "ector": 1426,
      "irst": 1427,
      "lib": 1428,
      "Data": 1429,
      "enu": 1430,
      "Me": 1431,
      "omm": 1432,
      "ATE": 1433,
      "rror": 1434,
      ".b": 1435,
      "urrent": 1436,
      "▁with": 1437,
      "De": 1438,
      "ass": 1439,
      "▁width:": 1440,
      "\")\n": 1441,
      "(1": 1442,
      "return": 1443,
      "▁href=\"": 1444,
      "▁__": 1445,
      "▁{\n\n": 1446,
      "uffer": 1447,
      "▁private": 1448,
      "ook": 1449,
      "_P": 1450,
      "enter": 1451,
      "▁}\n}\n\n": 1452,
      "ta": 1453,
      "span": 1454,
      "fo": 1455,
      "38": 1456,
      "ne": 1457,
      "ix": 1458,
      "ty": 1459,
      "200": 1460,
      "cp": 1461,
      "ies": 1462,
      ".d": 1463,
      "reak": 1464,
      ".println": 1465,
      "_re": 1466,
      "is.": 1467,
      "▁do": 1468,
      "▁col": 1469,
      "▁1,": 1470,
      "ary": 1471,
      "item": 1472,
      "http://": 1473,
      "ph": 1474,
      "ire": 1475,
      "▁src": 1476,
      "ork": 1477,
      "iv": 1478,
      ".re": 1479,
      "▁null": 1480,
      "[0]": 1481,
      "201": 1482,
      "er(": 1483,
      "▁padding": 1484,
      "over": 1485,
      ".w": 1486,
      "left:": 1487,
      "};\n\n": 1488,
      "▁Re": 1489,
      "▁`": 1490,
      "\\n\",": 1491,
      ");\n}\n\n": 1492,
      "▁In": 1493,
      "ill": 1494,
      "arent": 1495,
      "(self": 1496,
      "tri": 1497,
      "=0": 1498,
      "erator": 1499,
      "▁&&": 1500,
      "sign": 1501,
      "eg": 1502,
      "ystem.out": 1503,
      "dd": 1504,
      "_f": 1505,
      "▁,": 1506,
      "ard": 1507,
      "adi": 1508,
      "-r": 1509,
      "time": 1510,
      "Element": 1511,
      "pport": 1512,
      "-1": 1513,
      "Se": 1514,
      "▁url": 1515,
      "AD": 1516,
      "webkit-": 1517,
      ".add": 1518,
      "UE": 1519,
      "50": 1520,
      "ng": 1521,
      "osition:": 1522,
      "lient": 1523,
      "30": 1524,
      "4,": 1525,
      "tem": 1526,
      "'\n": 1527,
      "▁org": 1528,
      "Error": 1529,
      "▁while": 1530,
      "▁</div": 1531,
      "header": 1532,
      "22": 1533,
      "ther": 1534,
      "####": 1535,
      "];\n": 1536,
      "ence": 1537,
      "mit": 1538,
      "tes": 1539,
      "▁that": 1540,
      "000": 1541,
      "own": 1542,
      "▁style": 1543,
      "uto": 1544,
      "num": 1545,
      "so": 1546,
      "▁IN": 1547,
      "ale": 1548,
      "unity": 1549,
      "ource": 1550,
      "▁ar": 1551,
      "Time": 1552,
      "index": 1553,
      "Int": 1554,
      "▁no": 1555,
      "By": 1556,
      "par": 1557,
      "Text": 1558,
      "74": 1559,
      ">>": 1560,
      "(m": 1561,
      "\n{\n": 1562,
      "');\n": 1563,
      "To": 1564,
      "▁1.": 1565,
      "cc": 1566,
      "stance": 1567,
      "ystem.out.println": 1568,
      "\";\n": 1569,
      "▁9": 1570,
      "▁add": 1571,
      "▁so": 1572,
      "tom": 1573,
      "spon": 1574,
      "ash": 1575,
      "img": 1576,
      ".h>\n#include": 1577,
      "Event": 1578,
      "s)": 1579,
      "(a": 1580,
      "Qu": 1581,
      "▁false": 1582,
      "],": 1583,
      "ERE": 1584,
      "pen": 1585,
      "inal": 1586,
      "lete": 1587,
      "();\n\n": 1588,
      "oost": 1589,
      "ET": 1590,
      "ample": 1591,
      "▁temp": 1592,
      "ottom": 1593,
      "_T": 1594,
      "▁\\": 1595,
      "old": 1596,
      "16": 1597,
      "Opport": 1598,
      "table": 1599,
      "▁0x": 1600,
      ".m": 1601,
      "alloc": 1602,
      "form:": 1603,
      "Opportunity": 1604,
      ":0": 1605,
      "▁time": 1606,
      "ave": 1607,
      "▁type=\"text": 1608,
      "ilter": 1609,
      "width:": 1610,
      "();": 1611,
      "▁name=\"": 1612,
      "word": 1613,
      "24": 1614,
      "option": 1615,
      "ner": 1616,
      "core": 1617,
      "link": 1618,
      "title": 1619,
      "start": 1620,
      "▁self.": 1621,
      "},": 1622,
      "UT": 1623,
      ";\n\t": 1624,
      "▁import": 1625,
      "▁color:": 1626,
      "ontain": 1627,
      "▁k": 1628,
      "select": 1629,
      "ssion": 1630,
      "State": 1631,
      "IC": 1632,
      "signed": 1633,
      "▁cout": 1634,
      "anel": 1635,
      "no": 1636,
      "].": 1637,
      "7,": 1638,
      "▁AS": 1639,
      ">\n\n<": 1640,
      "_m": 1641,
      "▁read": 1642,
      "map": 1643,
      "\"></": 1644,
      "15": 1645,
      "▁none": 1646,
      "▁string": 1647,
      "background": 1648,
      "▁par": 1649,
      "app": 1650,
      ".com": 1651,
      "sk": 1652,
      "▁1L,": 1653,
      "Item": 1654,
      "(i": 1655,
      "_M": 1656,
      "-p": 1657,
      "▁height:": 1658,
      "NA": 1659,
      "rot": 1660,
      "ault": 1661,
      "erson": 1662,
      "label": 1663,
      "9,": 1664,
      "rite": 1665,
      "</div>\n": 1666,
      "HERE": 1667,
      "▁style=\"": 1668,
      "init": 1669,
      "this.": 1670,
      "▁true": 1671,
      "▁src=\"": 1672,
      "-color:": 1673,
      "(this": 1674,
      "Ke": 1675,
      "Ser": 1676,
      "Ar": 1677,
      "DE": 1678,
      "ound": 1679,
      "TR": 1680,
      "yth": 1681,
      "ual": 1682,
      "▁i++": 1683,
      "java": 1684,
      "▁count": 1685,
      "3d(": 1686,
      "▁--": 1687,
      "ush": 1688,
      "tribu": 1689,
      "lid": 1690,
      "ach": 1691,
      "Comp": 1692,
      "pert": 1693,
      "(t": 1694,
      "ML": 1695,
      "size:": 1696,
      "':": 1697,
      ";\nimport": 1698,
      "▁File": 1699,
      "bl": 1700,
      "▁we": 1701,
      "raw": 1702,
      "▁FROM": 1703,
      "Out": 1704,
      "std::": 1705,
      "▁break": 1706,
      "▁2L,": 1707,
      "[2": 1708,
      "▁form": 1709,
      "▁System.out.println": 1710,
      "18": 1711,
      "ait": 1712,
      "ger": 1713,
      "▁)\n": 1714,
      "3333": 1715,
      "ox": 1716,
      "Object": 1717,
      "▁function()": 1718,
      "▁);\n": 1719,
      "3.": 1720,
      "▁sh": 1721,
      "▁test": 1722,
      "')\n": 1723,
      "sponse": 1724,
      "ted": 1725,
      "▁error": 1726,
      "ern": 1727,
      "▁NA": 1728,
      ".e": 1729,
      "gle": 1730,
      "ython": 1731,
      "next": 1732,
      ".g": 1733,
      "▁number": 1734,
      "cond": 1735,
      "▁ser": 1736,
      "nav": 1737,
      "lace": 1738,
      "err": 1739,
      "▁#include": 1740,
      "node": 1741,
      "▁sp": 1742,
      "55": 1743,
      "▁-webkit-": 1744,
      "roll": 1745,
      "////": 1746,
      "▁mem": 1747,
      "_B": 1748,
      "idd": 1749,
      ".app": 1750,
      "CH": 1751,
      "unc": 1752,
      "umn": 1753,
      "back": 1754,
      "\",\n": 1755,
      "bar": 1756,
      "io": 1757,
      "14": 1758,
      "());\n": 1759,
      "▁num": 1760,
      "ick": 1761,
      "AB": 1762,
      "▁X": 1763,
      "Hist": 1764,
      "▁ul": 1765,
      "align": 1766,
      "open": 1767,
      "▁result": 1768,
      "▁</div>\n": 1769,
      "arch": 1770,
      "height:": 1771,
      "00000": 1772,
      "(function()": 1773,
      "port": 1774,
      "\"><": 1775,
      "▁java.": 1776,
      "--------------------------------": 1777,
      "<char": 1778,
      "OT": 1779,
      "Tr": 1780,
      "(const": 1781,
      "Line": 1782,
      "</a": 1783,
      "splay:": 1784,
      "sol": 1785,
      "3]": 1786,
      "▁user": 1787,
      "\n#": 1788,
      "PE": 1789,
      "Table": 1790,
      "font-": 1791,
      "ule": 1792,
      "dio": 1793,
      "Th": 1794,
      "▁float": 1795,
      "ie": 1796,
      "last": 1797,
      "()\n{\n": 1798,
      "1)": 1799,
      "Key": 1800,
      "35": 1801,
      "plot": 1802,
      "ild": 1803,
      "to": 1804,
      "ormal": 1805,
      "80": 1806,
      "00,": 1807,
      "▁*/\n\n": 1808,
      "Stream": 1809,
      "▁SE": 1810,
      "▁value=\"": 1811,
      "▁<st": 1812,
      "hild": 1813,
      "(new": 1814,
      "6,": 1815,
      "col": 1816,
      "son": 1817,
      "▁ab": 1818,
      "CK": 1819,
      "sed": 1820,
      "▁double": 1821,
      "▁some": 1822,
      "space": 1823,
      "▁row": 1824,
      "....": 1825,
      "ily": 1826,
      "df": 1827,
      "He": 1828,
      "{\"": 1829,
      "▁comp": 1830,
      "ache": 1831,
      "AX": 1832,
      "SELECT": 1833,
      "x_": 1834,
      "▁});\n": 1835,
      "▁text-": 1836,
      "▁key": 1837,
      "oost::": 1838,
      "ade": 1839,
      "34": 1840,
      "▁function(": 1841,
      "atus": 1842,
      "<<": 1843,
      "lat": 1844,
      "19": 1845,
      ":h": 1846,
      "Ed": 1847,
      "ide": 1848,
      "▁solid": 1849,
      "ION": 1850,
      "margin": 1851,
      "▁12": 1852,
      "his": 1853,
      "8,": 1854,
      "▁item": 1855,
      "\">\n<": 1856,
      "query": 1857,
      "▁top": 1858,
      "▁case": 1859,
      "▁table": 1860,
      "ep": 1861,
      "0px;\n": 1862,
      "ing.": 1863,
      "▁left": 1864,
      "ateg": 1865,
      "▁AND": 1866,
      "roup": 1867,
      "History": 1868,
      "-top": 1869,
      "fer": 1870,
      "l;\n": 1871,
      "move": 1872,
      "UR": 1873,
      "▁ON": 1874,
      "sert": 1875,
      "US": 1876,
      "▁are": 1877,
      "of(": 1878,
      "\n\t": 1879,
      "duct": 1880,
      "▁$('": 1881,
      "▁100%": 1882,
      "▁le": 1883,
      "%s": 1884,
      "face": 1885,
      "ader": 1886,
      "(),": 1887,
      "_name": 1888,
      "▁z": 1889,
      "▁en": 1890,
      "▁0;\n}\n\n": 1891,
      "util": 1892,
      "ccess": 1893,
      "otal": 1894,
      "%d": 1895,
      "t.": 1896,
      "onent": 1897,
      "▁select": 1898,
      "\"),": 1899,
      "▁$(\"": 1900,
      "*/": 1901,
      "align:": 1902,
      "ME": 1903,
      "SS": 1904,
      "(n": 1905,
      "lag": 1906,
      "(b": 1907,
      "▁start": 1908,
      "using": 1909,
      "Form": 1910,
      "field": 1911,
      "▁document": 1912,
      "amily": 1913,
      "foo": 1914,
      "\n#define": 1915,
      "ontainer": 1916,
      "){": 1917,
      "),\n": 1918,
      "count": 1919,
      "▁(int": 1920,
      "Man": 1921,
      "▁object": 1922,
      "▁3L,": 1923,
      ".in": 1924,
      "User": 1925,
      "lean": 1926,
      "At": 1927,
      "▁My": 1928,
      "rap": 1929,
      "ject": 1930,
      "nection": 1931,
      "\");\n\n": 1932,
      "AQ": 1933,
      "td>\n": 1934,
      "nect": 1935,
      "CE": 1936,
      "...\n": 1937,
      "ommand": 1938,
      "a,": 1939,
      "code": 1940,
      "padding": 1941,
      "ens": 1942,
      "peat": 1943,
      "-re": 1944,
      "▁can": 1945,
      "▁type=\"text/": 1946,
      "LO": 1947,
      "Set": 1948,
      "min": 1949,
      "uff": 1950,
      "▁...": 1951,
      "▁try": 1952,
      "(\n": 1953,
      "ear": 1954,
      "template": 1955,
      "▁St": 1956,
      "Of": 1957,
      "sub": 1958,
      ".html": 1959,
      "▁c(": 1960,
      "▁0.0": 1961,
      "88": 1962,
      "Id\":\"": 1963,
      "▁System.out.println(\"": 1964,
      "▁long": 1965,
      "44": 1966,
      "0174": 1967,
      "▁||": 1968,
      "www": 1969,
      "object": 1970,
      "mail": 1971,
      "FieldHistory": 1972,
      "OpportunityFieldHistory": 1973,
      "017400000": 1974,
      "17": 1975,
      "ark": 1976,
      "▁call": 1977,
      "▁all": 1978,
      "Create": 1979,
      "▁foo": 1980,
      "rit": 1981,
      "red": 1982,
      "▁node": 1983,
      "▁SELECT": 1984,
      "gb": 1985,
      ".frame": 1986,
      "ager": 1987,
      "000000": 1988,
      "▁date": 1989,
      "13": 1990,
      "()\n\n": 1991,
      "-left:": 1992,
      ":n": 1993,
      "=c": 1994,
      "from": 1995,
      "_ptr": 1996,
      "reen": 1997,
      "UN": 1998,
      "fd": 1999,
      "ail": 2000,
      ".sw": 2001,
      "*)": 2002,
      "▁up": 2003,
      "ined": 2004,
      "andle": 2005,
      "▁84": 2006,
      "(re": 2007,
      "AN": 2008,
      "IS": 2009,
      "▁background:": 2010,
      "Listener": 2011,
      "Map": 2012,
      "_w": 2013,
      "cout": 2014,
      "▁position:": 2015,
      "ram": 2016,
      "▁throw": 2017,
      "▁org.": 2018,
      "Par": 2019,
      "ob": 2020,
      "ould": 2021,
      "▁0)": 2022,
      "thing": 2023,
      "ell": 2024,
      "pect": 2025,
      "95": 2026,
      "▁-1": 2027,
      ".png": 2028,
      "au": 2029,
      ".A": 2030,
      "sg": 2031,
      "▁here": 2032,
      "▁1;\n": 2033,
      "off": 2034,
      "▁run": 2035,
      "acity": 2036,
      "YPE": 2037,
      "▁sy": 2038,
      "60": 2039,
      "action": 2040,
      "\"\n\n": 2041,
      "((": 2042,
      "button": 2043,
      ".r": 2044,
      "_F": 2045,
      "dec": 2046,
      "------": 2047
    },
    "merges": [
      [
        "i",
        "n"
      ],
      [
        ";",
        "\n"
      ],
      [
        "e",
        "r"
      ],
      [
        "o",
        "n"
      ],
      [
        "s",
        "t"
      ],
      [
        "r",
        "e"
      ],
      [
        "a",
        "t"
      ],
      [
        "o",
        "r"
      ],
      [
        "l",
        "e"
      ],
      [
        "▁",
        "="
      ],
      [
        "\n",
        "\n"
      ],
      [
        "▁",
        "t"
      ],
      [
        "a",
        "r"
      ],
      [
        "e",
        "n"
      ],
      [
        "-",
        "-"
      ],
      [
        ")",
        ";\n"
      ],
      [
        "▁",
        "c"
      ],
      [
        "s",
        "e"
      ],
      [
        "a",
        "l"
      ],
      [
        "c",
        "t"
      ],
      [
        "i",
        "t"
      ],
      [
        "a",
        "n"
      ],
      [
        "d",
        "e"
      ],
      [
        "{",
        "\n"
      ],
      [
        "▁",
        "<"
      ],
      [
        "m",
        "e"
      ],
      [
        "i",
        "on"
      ],
      [
        "▁",
        "f"
      ],
      [
        "▁",
        "p"
      ],
      [
        "o",
        "u"
      ],
      [
        "in",
        "t"
      ],
      [
        ")",
        "\n"
      ],
      [
        "0",
        "0"
      ],
      [
        "▁",
        "i"
      ],
      [
        "l",
        "i"
      ],
      [
        "h",
        "e"
      ],
      [
        "▁",
        "s"
      ],
      [
        "▁",
        "("
      ],
      [
        ">",
        "\n"
      ],
      [
        "g",
        "e"
      ],
      [
        "▁",
        "{\n"
      ],
      [
        "s",
        "s"
      ],
      [
        "▁",
        "n"
      ],
      [
        "a",
        "d"
      ],
      [
        "\t",
        "\t"
      ],
      [
        "in",
        "g"
      ],
      [
        "▁",
        "}"
      ],
      [
        "▁",
        "1"
      ],
      [
        "=",
        "\""
      ],
      [
        "l",
        "a"
      ],
      [
        "r",
        "o"
      ],
      [
        "▁",
        "0"
      ],
      [
        "en",
        "t"
      ],
      [
        "▁",
        "\""
      ],
      [
        "▁",
        "b"
      ],
      [
        "i",
        "d"
      ],
      [
        "at",
        "e"
      ],
      [
        "--",
        "--"
      ],
      [
        "▁",
        "*"
      ],
      [
        "d",
        "i"
      ],
      [
        "t",
        "e"
      ],
      [
        "t",
        "h"
      ],
      [
        "c",
        "k"
      ],
      [
        "u",
        "r"
      ],
      [
        "c",
        "e"
      ],
      [
        "l",
        "o"
      ],
      [
        "u",
        "n"
      ],
      [
        "▁",
        "re"
      ],
      [
        "/",
        "/"
      ],
      [
        "a",
        "me"
      ],
      [
        "▁",
        "\n"
      ],
      [
        "▁",
        "a"
      ],
      [
        "m",
        "p"
      ],
      [
        "▁",
        "m"
      ],
      [
        "(",
        ")"
      ],
      [
        "t",
        "r"
      ],
      [
        "o",
        "l"
      ],
      [
        "\"",
        ","
      ],
      [
        "u",
        "e"
      ],
      [
        "▁",
        "st"
      ],
      [
        "s",
        "."
      ],
      [
        "▁",
        "v"
      ],
      [
        "(",
        "\""
      ],
      [
        "e",
        "l"
      ],
      [
        "▁",
        "w"
      ],
      [
        "c",
        "h"
      ],
      [
        "p",
        "x"
      ],
      [
        "i",
        "g"
      ],
      [
        "u",
        "t"
      ],
      [
        "<",
        "/"
      ],
      [
        "p",
        "e"
      ],
      [
        "h",
        "t"
      ],
      [
        "ct",
        "ion"
      ],
      [
        "o",
        "p"
      ],
      [
        "▁",
        "d"
      ],
      [
        "u",
        "m"
      ],
      [
        "x",
        "t"
      ],
      [
        "▁",
        "S"
      ],
      [
        "la",
        "ss"
      ],
      [
        "}",
        "\n\n"
      ],
      [
        "h",
        "i"
      ],
      [
        "r",
        "i"
      ],
      [
        "ge",
        "t"
      ],
      [
        "▁t",
        "he"
      ],
      [
        "▁",
        "in"
      ],
      [
        "e",
        "d"
      ],
      [
        "ur",
        "n"
      ],
      [
        "e",
        "w"
      ],
      [
        "▁",
        "'"
      ],
      [
        "t",
        "urn"
      ],
      [
        "u",
        "l"
      ],
      [
        "n",
        "t"
      ],
      [
        "▁}",
        "\n"
      ],
      [
        "▁",
        "2"
      ],
      [
        "*",
        "*"
      ],
      [
        "L",
        ","
      ],
      [
        "di",
        "v"
      ],
      [
        ";\n",
        "\n"
      ],
      [
        "▁",
        "//"
      ],
      [
        "r",
        "a"
      ],
      [
        "in",
        "e"
      ],
      [
        "at",
        "a"
      ],
      [
        ":",
        ":"
      ],
      [
        ".",
        "."
      ],
      [
        "ou",
        "t"
      ],
      [
        "b",
        "le"
      ],
      [
        "▁",
        "T"
      ],
      [
        "m",
        "a"
      ],
      [
        ");\n",
        "\n"
      ],
      [
        "on",
        "t"
      ],
      [
        "▁",
        "+"
      ],
      [
        "▁",
        "e"
      ],
      [
        "▁i",
        "f"
      ],
      [
        "=",
        "="
      ],
      [
        "o",
        "f"
      ],
      [
        "i",
        "l"
      ],
      [
        "u",
        "b"
      ],
      [
        "▁",
        "-"
      ],
      [
        "o",
        "de"
      ],
      [
        "▁",
        "int"
      ],
      [
        "i",
        "le"
      ],
      [
        "y",
        "pe"
      ],
      [
        "e",
        "t"
      ],
      [
        "o",
        "o"
      ],
      [
        "i",
        "z"
      ],
      [
        "u",
        "s"
      ],
      [
        "▁re",
        "turn"
      ],
      [
        "i",
        "c"
      ],
      [
        "p",
        "t"
      ],
      [
        "un",
        "ction"
      ],
      [
        "a",
        "v"
      ],
      [
        "or",
        "t"
      ],
      [
        "s",
        "p"
      ],
      [
        "o",
        "m"
      ],
      [
        "▁",
        "#"
      ],
      [
        "r",
        "int"
      ],
      [
        "----",
        "----"
      ],
      [
        ".",
        "c"
      ],
      [
        ".",
        "p"
      ],
      [
        "an",
        "d"
      ],
      [
        "al",
        "ue"
      ],
      [
        "▁",
        "A"
      ],
      [
        "st",
        "r"
      ],
      [
        "▁",
        "C"
      ],
      [
        "a",
        "ck"
      ],
      [
        "▁",
        "N"
      ],
      [
        "o",
        "t"
      ],
      [
        "▁",
        "h"
      ],
      [
        "▁",
        "{"
      ],
      [
        "en",
        "d"
      ],
      [
        "▁",
        "se"
      ],
      [
        "ad",
        "d"
      ],
      [
        ":",
        "\n"
      ],
      [
        "li",
        "c"
      ],
      [
        "de",
        "f"
      ],
      [
        "or",
        "m"
      ],
      [
        "e",
        "ct"
      ],
      [
        ",",
        "\n"
      ],
      [
        "p",
        "p"
      ],
      [
        "iz",
        "e"
      ],
      [
        "▁",
        "I"
      ],
      [
        "ig",
        "ht"
      ],
      [
        "at",
        "ion"
      ],
      [
        "ar",
        "g"
      ],
      [
        "n",
        "d"
      ],
      [
        "or",
        "d"
      ],
      [
        "f",
        "f"
      ],
